Masmiseim36/nxpSDK/devices/MIMXRT106A/drivers/fsl_enet.c
    /* Enables the interrupt. */
    EnableGlobalIRQ(primask);
}

/*!
 * brief Sets the ENET PTP 1588 timer to the assigned time.
 *
 * param base  ENET peripheral base address.
 * param handle The ENET state pointer. This is the same state pointer used in the ENET_Init.
 * param ptpTime The timer to be set to the PTP timer.
 */
void ENET_Ptp1588SetTimer(ENET_Type *base, enet_handle_t *handle, enet_ptp_time_t *ptpTime)
{
    assert(handle != NULL);
    assert(ptpTime != NULL);

    uint32_t primask;

    /* Disables the interrupt. */
    primask = DisableGlobalIRQ();

    /* Sets PTP timer. */
    handle->msTimerSecond = ptpTime->second;
    base->ATVR            = ptpTime->nanosecond;

    /* Enables the interrupt. */
    EnableGlobalIRQ(primask);
}

/*!
 * brief Adjusts the ENET PTP 1588 timer.
 *
 * param base  ENET peripheral base address.
 * param corrIncrease The correction increment value. This value is added every time the correction
 *       timer expires. A value less than the PTP timer frequency(1/ptpClkSrc) slows down the timer,
 *        a value greater than the 1/ptpClkSrc speeds up the timer.
 * param corrPeriod The PTP timer correction counter wrap-around value. This defines after how
 *       many timer clock the correction counter should be reset and trigger a correction
 *       increment on the timer. A value of 0 disables the correction counter and no correction occurs.
 */
void ENET_Ptp1588AdjustTimer(ENET_Type *base, uint32_t corrIncrease, uint32_t corrPeriod)
{
    /* Set correction for PTP timer increment. */
    base->ATINC = (base->ATINC & ~ENET_ATINC_INC_CORR_MASK) | (corrIncrease << ENET_ATINC_INC_CORR_SHIFT);
    /* Set correction for PTP timer period. */
    base->ATCOR = (base->ATCOR & ~ENET_ATCOR_COR_MASK) | (corrPeriod << ENET_ATCOR_COR_SHIFT);
}

static status_t ENET_Ptp1588UpdateTimeRing(enet_ptp_time_data_ring_t *ptpTsDataRing, enet_ptp_time_data_t *ptpTimeData)
{
    assert(ptpTsDataRing != NULL);
    assert(ptpTsDataRing->ptpTsData != NULL);
    assert(ptpTimeData != NULL);

    uint16_t usedBuffer = 0;

    /* Check if the buffers ring is full. */
    if (ptpTsDataRing->end >= ptpTsDataRing->front)
    {
        usedBuffer = ptpTsDataRing->end - ptpTsDataRing->front;
    }
    else
    {
        usedBuffer = ptpTsDataRing->size - (ptpTsDataRing->front - ptpTsDataRing->end);
    }

    if (usedBuffer == (ptpTsDataRing->size - 1))
    {
        /* Ptp timestamp ring full, drop one in the front. */
        ptpTsDataRing->front = (ptpTsDataRing->front + 1) % ptpTsDataRing->size;
    }

    /* Copy the new data into the buffer. */
    enet_pvoid_to_u32_t dest;
    enet_pvoid_to_u32_t src;
    dest.u32 = (uint32_t)ptpTsDataRing->ptpTsData + ptpTsDataRing->end * sizeof(enet_ptp_time_data_t);
    src.u32  = (uint32_t)ptpTimeData;
    (void)memcpy(dest.pvoid, src.pvoid, sizeof(enet_ptp_time_data_t));

    /* Increase the buffer pointer to the next empty one. */
    ptpTsDataRing->end = (ptpTsDataRing->end + 1) % ptpTsDataRing->size;

    return kStatus_Success;
}

static status_t ENET_Ptp1588SearchTimeRing(enet_ptp_time_data_ring_t *ptpTsDataRing, enet_ptp_time_data_t *ptpTimedata)
{
    assert(ptpTsDataRing != NULL);
    assert(ptpTsDataRing->ptpTsData != NULL);
    assert(ptpTimedata != NULL);

    uint32_t index;
    uint32_t size;
    uint16_t usedBuffer   = 0;
    bool isRingBufferFull = false;
    status_t result       = kStatus_Success;
    bool isReturn         = false;

    /* Check the PTP 1588 timestamp ring. */
    if (ptpTsDataRing->front == ptpTsDataRing->end)
    {
        result = kStatus_ENET_PtpTsRingEmpty;
    }
    else
    {
        /* Check if buffers is full. */
        if (ptpTsDataRing->end >= ptpTsDataRing->front)
        {
            usedBuffer = ptpTsDataRing->end - ptpTsDataRing->front;
        }
        else
        {
            usedBuffer = ptpTsDataRing->size - (ptpTsDataRing->front - ptpTsDataRing->end);
        }

        if (usedBuffer == (ptpTsDataRing->size - 1))
        {
            isRingBufferFull = true;
        }

        /* Search the element in the ring buffer */
        index = ptpTsDataRing->front;
        size  = ptpTsDataRing->size;
        while (index != ptpTsDataRing->end)
        {
            if (((ptpTsDataRing->ptpTsData + index)->sequenceId == ptpTimedata->sequenceId) &&
                (!memcmp(((void *)&(ptpTsDataRing->ptpTsData + index)->sourcePortId[0]),
                         (void *)&ptpTimedata->sourcePortId[0], kENET_PtpSrcPortIdLen)) &&
                ((ptpTsDataRing->ptpTsData + index)->version == ptpTimedata->version) &&
                ((ptpTsDataRing->ptpTsData + index)->messageType == ptpTimedata->messageType))
            {
                break;
            }

            /* Increase the ptp ring index. */
            index = (index + 1) % size;
        }

        if (index == ptpTsDataRing->end)
        {
            if (isRingBufferFull == true)
            {
                /* PTP timestamp buffer ring full, data in index ptpTsDataRing->end is valid. */
                if (((ptpTsDataRing->ptpTsData + index)->sequenceId != ptpTimedata->sequenceId) ||
                    (memcmp(((void *)&(ptpTsDataRing->ptpTsData + index)->sourcePortId[0]),
                            (void *)&ptpTimedata->sourcePortId[0], kENET_PtpSrcPortIdLen)) ||
                    ((ptpTsDataRing->ptpTsData + index)->version != ptpTimedata->version) ||
                    ((ptpTsDataRing->ptpTsData + index)->messageType != ptpTimedata->messageType))
                {
                    isReturn = true;
                    result   = kStatus_ENET_PtpTsRingFull;
                }
            }
            else
            {
                isReturn = true;
                result   = kStatus_ENET_PtpTsRingFull;
            }
        }

        if (isReturn == false)
        {
            /* Get the right timestamp of the required ptp messag. */
            ptpTimedata->timeStamp.second     = (ptpTsDataRing->ptpTsData + index)->timeStamp.second;
            ptpTimedata->timeStamp.nanosecond = (ptpTsDataRing->ptpTsData + index)->timeStamp.nanosecond;

            if (isRingBufferFull == true)
            {
                /* If ring buffer full, move front pointer to next pointer behind end pointer, then next
                read will still read whole ring. */
                ptpTsDataRing->end = index;
            }

            /* Drop previous ptp stamp. */
            ptpTsDataRing->front = (index + 1) % size;
        }
    }

    return result;
}

static status_t ENET_StoreRxFrameTime(ENET_Type *base, enet_handle_t *handle, enet_ptp_time_data_t *ptpTimeData)
{
    assert(handle != NULL);
    assert(ptpTimeData != NULL);

    enet_ptp_time_t ptpTimer;

    /* Get current PTP timer nanosecond value. */
    ENET_Ptp1588GetTimer(base, handle, &ptpTimer);

    /* Get transmit time stamp second. */
    if (ptpTimer.nanosecond >= ptpTimeData->timeStamp.nanosecond)
    {
        ptpTimeData->timeStamp.second = ptpTimer.second;
    }
    else
    {
        ptpTimeData->timeStamp.second = ptpTimer.second - 1;
    }

